Revit 2024 API
BuiltInFailures.InterferenceFailures Class
 Failures about Interference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class InterferenceFailures
Visual Basic
Public NotInheritable Class InterferenceFailures
Visual C++
public ref class InterferenceFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures
See Also
BuiltInFailures.InterferenceFailures Members
Autodesk.Revit.DB Namespace